aidan-clyens/Wristband/project_zero_cc2640r2lp_app/Startup/CC2640R2_PCB.c
/*
 *  =============================== GPIO ===============================
 */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/gpio/GPIOCC26XX.h>

/*
 * Array of Pin configurations
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in CC2640R2_PCB.h
 * NOTE: Pins not used for interrupts should be placed at the end of the
 *       array. Callback entries can be omitted from callbacks array to
 *       reduce memory usage.
 */
GPIO_PinConfig gpioPinConfigs[] = {
    /* Input pins */
    GPIOCC26XX_DIO_23 | GPIO_DO_NOT_CONFIG,  /* Button 0 */

    /* Output pins */
    GPIOCC26XX_DIO_21 | GPIO_DO_NOT_CONFIG,  /* Green LED */
    GPIOCC26XX_DIO_22 | GPIO_DO_NOT_CONFIG,  /* Red LED */
    GPIOCC26XX_DIO_30 | GPIO_DO_NOT_CONFIG,  /* TMP116_EN */

    /* SPI Flash CSN */
    GPIOCC26XX_DIO_20 | GPIO_DO_NOT_CONFIG,

    /* SD CS */
    GPIOCC26XX_DIO_21 | GPIO_DO_NOT_CONFIG,
};

/*
 * Array of callback function pointers
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in CC2640R2_LAUNCH.h
 * NOTE: Pins not used for interrupts can be omitted from callbacks array to
 *       reduce memory usage (if placed at end of gpioPinConfigs array).
 */
GPIO_CallbackFxn gpioCallbackFunctions[] = {
    NULL,  /* Button 0 */
    NULL,  /* CC2640R2_PCB_SPI_MASTER_READY */
    NULL,  /* CC2640R2_PCB_SPI_SLAVE_READY */
};

const GPIOCC26XX_Config GPIOCC26XX_config = {
    .pinConfigs         = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks          = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = CC2640R2_PCB_GPIOCOUNT,
    .numberOfCallbacks  = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority        = (~0)
};

/*
 *  =============================== GPTimer ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/timer/GPTimerCC26XX.h>

GPTimerCC26XX_Object gptimerCC26XXObjects[CC2640R2_PCB_GPTIMERCOUNT];

const GPTimerCC26XX_HWAttrs gptimerCC26xxHWAttrs[CC2640R2_PCB_GPTIMERPARTSCOUNT] = {
    { .baseAddr = GPT0_BASE, .intNum = INT_GPT0A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT0, .pinMux = GPT_PIN_0A, },
    { .baseAddr = GPT0_BASE, .intNum = INT_GPT0B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT0, .pinMux = GPT_PIN_0B, },
    { .baseAddr = GPT1_BASE, .intNum = INT_GPT1A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT1, .pinMux = GPT_PIN_1A, },
    { .baseAddr = GPT1_BASE, .intNum = INT_GPT1B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT1, .pinMux = GPT_PIN_1B, },
    { .baseAddr = GPT2_BASE, .intNum = INT_GPT2A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT2, .pinMux = GPT_PIN_2A, },
    { .baseAddr = GPT2_BASE, .intNum = INT_GPT2B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT2, .pinMux = GPT_PIN_2B, },
    { .baseAddr = GPT3_BASE, .intNum = INT_GPT3A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT3, .pinMux = GPT_PIN_3A, },
    { .baseAddr = GPT3_BASE, .intNum = INT_GPT3B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT3, .pinMux = GPT_PIN_3B, },
};

const GPTimerCC26XX_Config GPTimerCC26XX_config[CC2640R2_PCB_GPTIMERPARTSCOUNT] = {
    { &gptimerCC26XXObjects[CC2640R2_PCB_GPTIMER0], &gptimerCC26xxHWAttrs[CC2640R2_PCB_GPTIMER0A], GPT_A },
    { &gptimerCC26XXObjects[CC2640R2_PCB_GPTIMER0], &gptimerCC26xxHWAttrs[CC2640R2_PCB_GPTIMER0B], GPT_B },
    { &gptimerCC26XXObjects[CC2640R2_PCB_GPTIMER1], &gptimerCC26xxHWAttrs[CC2640R2_PCB_GPTIMER1A], GPT_A },
    { &gptimerCC26XXObjects[CC2640R2_PCB_GPTIMER1], &gptimerCC26xxHWAttrs[CC2640R2_PCB_GPTIMER1B], GPT_B },
    { &gptimerCC26XXObjects[CC2640R2_PCB_GPTIMER2], &gptimerCC26xxHWAttrs[CC2640R2_PCB_GPTIMER2A], GPT_A },
    { &gptimerCC26XXObjects[CC2640R2_PCB_GPTIMER2], &gptimerCC26xxHWAttrs[CC2640R2_PCB_GPTIMER2B], GPT_B },
    { &gptimerCC26XXObjects[CC2640R2_PCB_GPTIMER3], &gptimerCC26xxHWAttrs[CC2640R2_PCB_GPTIMER3A], GPT_A },
    { &gptimerCC26XXObjects[CC2640R2_PCB_GPTIMER3], &gptimerCC26xxHWAttrs[CC2640R2_PCB_GPTIMER3B], GPT_B },
};

/*
 *  =============================== I2C ===============================
*/
#include <ti/drivers/I2C.h>
#include <ti/drivers/i2c/I2CCC26XX.h>

I2CCC26XX_Object i2cCC26xxObjects[CC2640R2_PCB_I2CCOUNT];

const I2CCC26XX_HWAttrsV1 i2cCC26xxHWAttrs[CC2640R2_PCB_I2CCOUNT] = {
    {
        .baseAddr    = I2C0_BASE,
        .powerMngrId = PowerCC26XX_PERIPH_I2C0,
        .intNum      = INT_I2C_IRQ,
        .intPriority = ~0,
        .swiPriority = 0,
        .sdaPin      = CC2640R2_PCB_I2C0_SDA0,
        .sclPin      = CC2640R2_PCB_I2C0_SCL0,
    }
};

const I2C_Config I2C_config[CC2640R2_PCB_I2CCOUNT] = {
    {
        .fxnTablePtr = &I2CCC26XX_fxnTable,
        .object      = &i2cCC26xxObjects[CC2640R2_PCB_I2C0],
        .hwAttrs     = &i2cCC26xxHWAttrs[CC2640R2_PCB_I2C0]
    },
};

const uint_least8_t I2C_count = CC2640R2_PCB_I2CCOUNT;

/*
 *  =============================== I2S ===============================
*/
#include <ti/drivers/I2S.h>
#include <ti/drivers/i2s/I2SCC26XX.h>

I2SCC26XX_Object i2sCC26XXObjects[CC2640R2_PCB_I2SCOUNT];

const I2SCC26XX_HWAttrs i2sCC26XXHWAttrs[CC2640R2_PCB_I2SCOUNT] = {
    {
        .pinSD1      =  CC2640R2_PCB_I2S_ADI,
        .pinSD0      =  CC2640R2_PCB_I2S_ADO,
        .pinSCK      =  CC2640R2_PCB_I2S_BCLK,
        .pinMCLK     =  CC2640R2_PCB_I2S_MCLK,
        .pinWS       =  CC2640R2_PCB_I2S_WCLK,
        .intPriority = ~0,
    }
};

const I2S_Config I2S_config[CC2640R2_PCB_I2SCOUNT] = {
    {
        .object      = &i2sCC26XXObjects[CC2640R2_PCB_I2S0],
        .hwAttrs     = &i2sCC26XXHWAttrs[CC2640R2_PCB_I2S0]
    },
};

const uint_least8_t I2S_count = CC2640R2_PCB_I2SCOUNT;

/*
 *  =============================== NVS ===============================
 */
#include <ti/drivers/NVS.h>
#include <ti/drivers/nvs/NVSSPI25X.h>
#include <ti/drivers/nvs/NVSCC26XX.h>

#define NVS_REGIONS_BASE 0x1A000
#define SECTORSIZE       0x1000
#define REGIONSIZE       (SECTORSIZE * 4)

#ifndef Board_EXCLUDE_NVS_INTERNAL_FLASH

