aidan-clyens/Wristband/project_zero_cc2640r2lp_app/Startup/CC2640R2_PCB.c
const PWM_Config PWM_config[CC2640R2_PCB_PWMCOUNT] = {
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_PCB_PWM0], &pwmtimerCC26xxHWAttrs[CC2640R2_PCB_PWM0] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_PCB_PWM1], &pwmtimerCC26xxHWAttrs[CC2640R2_PCB_PWM1] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_PCB_PWM2], &pwmtimerCC26xxHWAttrs[CC2640R2_PCB_PWM2] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_PCB_PWM3], &pwmtimerCC26xxHWAttrs[CC2640R2_PCB_PWM3] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_PCB_PWM4], &pwmtimerCC26xxHWAttrs[CC2640R2_PCB_PWM4] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_PCB_PWM5], &pwmtimerCC26xxHWAttrs[CC2640R2_PCB_PWM5] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_PCB_PWM6], &pwmtimerCC26xxHWAttrs[CC2640R2_PCB_PWM6] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2_PCB_PWM7], &pwmtimerCC26xxHWAttrs[CC2640R2_PCB_PWM7] },
};

const uint_least8_t PWM_count = CC2640R2_PCB_PWMCOUNT;

/*
 *  =============================== RF Driver ===============================
 */
#include <ti/drivers/rf/RF.h>

const RFCC26XX_HWAttrsV2 RFCC26XX_hwAttrs = {
    .hwiPriority        = ~0,       /* Lowest HWI priority */
    .swiPriority        = 0,        /* Lowest SWI priority */
    .xoscHfAlwaysNeeded = true,     /* Keep XOSC dependency while in standby */
    .globalCallback     = NULL,     /* No board specific callback */
    .globalEventMask    = 0         /* No events subscribed to */
};

/*
 *  =============================== SD ===============================
 */
#include <ti/drivers/SD.h>
#include <ti/drivers/sd/SDSPI.h>

SDSPI_Object sdspiObjects[CC2640R2_PCB_SDCOUNT];

const SDSPI_HWAttrs sdspiHWAttrs[CC2640R2_PCB_SDCOUNT] = {
    {
        .spiIndex = CC2640R2_PCB_SPI0,
        .spiCsGpioIndex = CC2640R2_PCB_SDSPI_CS
    }
};

const SD_Config SD_config[CC2640R2_PCB_SDCOUNT] = {
    {
        .fxnTablePtr = &SDSPI_fxnTable,
        .object = &sdspiObjects[CC2640R2_PCB_SDSPI0],
        .hwAttrs = &sdspiHWAttrs[CC2640R2_PCB_SDSPI0]
    },
};

const uint_least8_t SD_count = CC2640R2_PCB_SDCOUNT;

/*
 *  =============================== SPI DMA ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPICC26XXDMA.h>

SPICC26XXDMA_Object spiCC26XXDMAObjects[CC2640R2_PCB_SPICOUNT];

/*
 * NOTE: The SPI instances below can be used by the SD driver to communicate
 * with a SD card via SPI.  The 'defaultTxBufValue' fields below are set to 0xFF
 * to satisfy the SDSPI driver requirement.
 */
const SPICC26XXDMA_HWAttrsV1 spiCC26XXDMAHWAttrs[CC2640R2_PCB_SPICOUNT] = {
    {
        .baseAddr           = SSI0_BASE,
        .intNum             = INT_SSI0_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin            = CC2640R2_PCB_SPI0_MOSI,
        .misoPin            = CC2640R2_PCB_SPI0_MISO,
        .clkPin             = CC2640R2_PCB_SPI0_CLK,
        .csnPin             = CC2640R2_PCB_SPI0_CSN,
        .minDmaTransferSize = 10
    },
    {
        .baseAddr           = SSI1_BASE,
        .intNum             = INT_SSI1_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI1,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI1_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI1_TX,
        .mosiPin            = CC2640R2_PCB_SPI1_MOSI,
        .misoPin            = CC2640R2_PCB_SPI1_MISO,
        .clkPin             = CC2640R2_PCB_SPI1_CLK,
        .csnPin             = CC2640R2_PCB_SPI1_CSN,
        .minDmaTransferSize = 10
    }
};

const SPI_Config SPI_config[CC2640R2_PCB_SPICOUNT] = {
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[CC2640R2_PCB_SPI0],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[CC2640R2_PCB_SPI0]
    },
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[CC2640R2_PCB_SPI1],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[CC2640R2_PCB_SPI1]
    },
};

const uint_least8_t SPI_count = CC2640R2_PCB_SPICOUNT;

/*
 *  =============================== UART ===============================
 */
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTCC26XX.h>

UARTCC26XX_Object uartCC26XXObjects[CC2640R2_PCB_UARTCOUNT];

uint8_t uartCC26XXRingBuffer[CC2640R2_PCB_UARTCOUNT][32];

const UARTCC26XX_HWAttrsV2 uartCC26XXHWAttrs[CC2640R2_PCB_UARTCOUNT] = {
    {
        .baseAddr       = UART0_BASE,
        .powerMngrId    = PowerCC26XX_PERIPH_UART0,
        .intNum         = INT_UART0_COMB,
        .intPriority    = ~0,
        .swiPriority    = 0,
        .txPin          = CC2640R2_PCB_UART_TX,
        .rxPin          = CC2640R2_PCB_UART_RX,
        .ctsPin         = PIN_UNASSIGNED,
        .rtsPin         = PIN_UNASSIGNED,
        .ringBufPtr     = uartCC26XXRingBuffer[CC2640R2_PCB_UART0],
        .ringBufSize    = sizeof(uartCC26XXRingBuffer[CC2640R2_PCB_UART0]),
        .txIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_1_8,
        .rxIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_4_8,
        .errorFxn       = NULL
    }
};

const UART_Config UART_config[CC2640R2_PCB_UARTCOUNT] = {
    {
        .fxnTablePtr = &UARTCC26XX_fxnTable,
        .object      = &uartCC26XXObjects[CC2640R2_PCB_UART0],
        .hwAttrs     = &uartCC26XXHWAttrs[CC2640R2_PCB_UART0]
    },
};

const uint_least8_t UART_count = CC2640R2_PCB_UARTCOUNT;

/*
 *  =============================== UDMA ===============================
 */
#include <ti/drivers/dma/UDMACC26XX.h>

UDMACC26XX_Object udmaObjects[CC2640R2_PCB_UDMACOUNT];

const UDMACC26XX_HWAttrs udmaHWAttrs[CC2640R2_PCB_UDMACOUNT] = {
    {
        .baseAddr    = UDMA0_BASE,
        .powerMngrId = PowerCC26XX_PERIPH_UDMA,
        .intNum      = INT_DMA_ERR,
        .intPriority = ~0
    }
};

const UDMACC26XX_Config UDMACC26XX_config[CC2640R2_PCB_UDMACOUNT] = {
    {
         .object  = &udmaObjects[CC2640R2_PCB_UDMA0],
         .hwAttrs = &udmaHWAttrs[CC2640R2_PCB_UDMA0]
    },
};



